public class Task4 {
    public static void main(String[] args) {
        System.out.println("Ответ закомментирован, смотрите ниже");
    }
}
/*Задание 4. Дана скобочная последовательность: [((())()(())]]

- Можно ли считать эту последовательность правильной?
- Если ответ на предыдущий вопрос “нет” - то что необходимо в ней изменить, чтоб она стала правильной?



Ответ:

Нет.
Согласно одному из основных принципов инкапсуляции код, который относится к методу, классу, циклу, условию должен находиться между скобок. Будь-то круглые, квадратные, фигурные или другие скобки, все они должны быть закрыты, если были открыты. Код будет работать в пределах этих скобок.

Правильная скобочная  последовательность может иметь следующий вид: [[((())()(()))]] .
*/